a;arise;arose;arisen;возникать
a;awake;awoke;awoke;пробуждаться
b;be;was/were;been;быть
b;bear;bore;born;родиться
b;beat;beat;beaten;бить
b;become;became;become;становиться
b;befall;befell;befallen;приключаться
b;beget;begot/begat;begot/begotten;вызывать,порождать
b;begin;began;begun;начинать
b;behold;beheld;beheld;увидеть,узреть
b;bend;bent;bent;сгибать
b;beseech;beseech/besought;beseech/besought;просить,умолять
b;beset;beset;beset;осаждать,окружать
b;bestride;bestrode;bestridden;садиться,сидетьверхом
b;bet;bet;bet;держатьпари,бытьуверенным
b;bid;bid;bid;предлагатьцену
b;bind;bound;bound;вязать,связывать
b;bite;bit;bitten;кусать
b;bleed;bled;bled;кровоточить
b;bless;blessed/blest;blessed/blest;благословлять
b;blow;blew;blown;дуть
b;break;broke;broken;ломать
b;breed;bred;bred;размножать,порождать
b;bring;brought;brought;приносить
b;broadcast;broadcast/broadcasted;broadcast/broadcasted;транслировать
b;browbeat;browbeat;browbeaten;запугивать
b;build;built;built;строить
b;burn;burnt;burnt;гореть,жечь
b;burst;burst;burst;взрываться
b;bust;bust/busted;bust/busted;сломать,разрушать
b;buy;bought;bought;покупать
c;cast;cast;cast;бросать,кидать
c;catch;caught;caught;ловить
c;choose;chose;chosen;выбирать
c;cleave;cleave/clove/cleft;cleaved/cloven;раскалывать
c;cling;clung;clung;цепляться
c;come;came;come;приходить
c;cost;cost;cost;стоить
c;creep;crept;crept;ползать,красться
c;cut;cut;cut;резать
d;deal;dealt;dealt;иметьдело
d;dig;dug;dug;копать
d;do;did;done;делать
d;draw;drew;drawn;рисовать
d;dream;dreamt/dreamed;dreamt/dreamed;мечтать
d;drink;drank;drunk;пить
d;drive;drove;driven;вестимашину
d;dwell;dwelt;dwelt;подробноостанавливаться(начем-то)
e;eat;ate;eaten;есть
f;fall;fell;fallen;падать
f;feed;fed;fed;кормить
f;feel;felt;felt;чувствовать
f;fight;fought;fought;драться,бороться
f;find;found;found;находить
f;fit;fit;fit;быть впору,подходить
f;flee;fled;fled;убегать,спасатьсябегством
f;fling;flung;flung;бросать,кидать
f;fly;flew;flown;летать
f;forbear;forbore;forborne;воздерживаться
f;forbid;forbade/forbad;forbidden;запрещать
f;forecast;forecast/forecasted;forecast/forecasted;предсказывать
f;foresee;foresaw;foreseen;предвидеть
f;foretell;foretold;foretold;предсказывать
f;forget;forgot;forgotten;забывать
f;forgive;forgave;forgiven;прощать
f;forsake;forsook;forsaken;оставлять,покидать
f;forswear;forswore;foresworn;отказываться,отрекаться
f;freeze;froze;frozen;замерзать
g;gainsay;gainsaid;gainsaid;отрицать,возражать
g;get;got;got;получать
g;gird;girt/girded;girt/girded;опоясывать,подпоясываться
g;give;gave;given;давать
g;go;went;gone;идти
g;grind;ground;ground;молоть
g;grow;grew;grown;расти
h;hang;hung;hung;вешать
h;have;had;had;иметь
h;hew;hewed;hewed/hewn;разрубатьрассекать
h;hear;heard;heard;слышать
h;hide;hid;hidden;прятаться
h;hit;hit;hit;ударять
h;hold;held;held;держать
h;hurt;hurt;hurt;повредить,ушибить
i;input;input/inputted;input/inputted;вводить (вкомпьютер)
i;inset;inset;inset;вставлять,вкладывать
i;interweave;interwove;interwoven;переплетать,сплетать
k;keep;kept;kept;держать
k;kneel;knelt;knelt;стоятьнаколенях
k;knit;knit/knitted;knit/knitted;вязать
k;know;knew;known;знать
l;lay;laid;laid;класть
l;lean;leant/leaned;leant/leaned;наклоняться,прислоняться
l;lead;led;led;вести
l;learn;learnt/learned;learnt/learned;учить (что-либо)
l;leap;leapt/leaped;leapt/leaped;прыгать
l;leave;left;left;оставлять
l;lend;lent;lent;одалживать
l;let;let;let;позволять
l;lie;lay;lain;лежать
l;light;lit;lit;освещать,зажигать
l;lose;lost;lost;терять
m;make;made;made;делать
m;mean;meant;meant;иметьввиду,намереваться
m;meet;met;met;встречать
m;miscast;miscast;miscast;датьнеподходящуюроль
m;mishear;misheard;misheard;ослышаться
m;mishit;mishit;mishit;промахнуться
m;mislay;mislaid;mislaid;положитьненаместо
m;mislead;misled;misled;вводитьвзаблуждение
m;misread;misread;misread;прочитатьнеправильно
m;misspell;misspelt/misspelled;misspelt/misspelled;писатьсорфографическимиошибками
m;misspend;misspent;misspent;неразумно,зрятратить
m;mistake;mistook;mistaken;ошибаться
m;misunderstand;misunderstood;misunderstood;неправильнопонять
m;mow;mowed;mowed/mown;косить
o;outbid;outbid;outbid;перебиватьцену
o;outdo;outdid;outdone;превзойти
o;outgrow;outgrew;outgrown;перерастать,вырастать
o;output;output;output;выпускать,выводить(данные)
o;outrun;outran;outrun;перегонять,опережать
o;outsell;outsold;outsold;продаватьсялучше
o;outshine;outshone;outshone;затмить
o;overbid;overbid;overbid;перебиватьцену
o;overcome;overcame;overcome;преодолевать,побороть
o;overdo;overdid;overdone;перестараться
o;overeat;overate;overeaten;объедаться,передать
o;overfly;overflew;overflown;перелетать
o;overhang;overhung;overhung;нависать
o;overhear;overheard;overheard;подслушивать
o;overlay;overlaid;overlaid;покрывать
o;overpay;overpaid;overpaid;переплачивать
o;override;overrode;overridden;отменять,перевешивать
o;overrun;overran;overrun;переходитьпределы,границы
o;oversee;oversaw;overseen;наблюдать,надзирать
o;overshoot;overshot;overshot;промахнуться
o;oversleep;overslept;overslept;проспать
o;overtake;overtook;overtaken;обогнать,овладевать
o;overthrow;overthrew;overthrown;перебрасывать,свергать
p;partake;partook;partaken;приниматьучастие
p;pay;paid;paid;платить
p;prepay;prepaid;prepaid;платитьвперёд
p;prove;proved;proved/proven;доказывать
p;put;put;put;класть
q;quit;quit;quit;оставлять,покидать
r;read;read;read;читать
r;rebuild;rebuilt;rebuilt;отстроитьзаново,реконструировать
r;recast;recast;recast;переделывать,изменять
r;redo;redid;redone;делатьвновь,переделывать
r;remake;remade;remade;переделать
r;rend;rent;rent;раздиратьнакуски
r;repay;repaid;repaid;выплатить
r;rerun;reran;rerun;повторнопоказывать
r;resell;resold;resold;перепродавать
r;reset;reset;reset;вновьустанавливать,сбрасывать
r;resit;resat;resat;пересдавать
r;retake;retook;retaken;пересдаватьэкзамен
r;retell;retold;retold;пересказывать
r;rewrite;rewrote;rewritten;переписать
r;ride;rode;ridden;ездитьверхом
r;ring;rung;rung;звонить
r;rise;rose;risen;подниматься
r;run;ran;run;бежать
s;saw;sawed;sawn;пилить
s;say;said;said;говорить
s;see;saw;seen;видеть
s;seek;sought;sought;искать
s;sell;sold;sold;продавать
s;send;sent;sent;отправлять
s;set;set;set;ставить,устанавливать
s;sew;sewed;sewn;шить
s;shake;shook;shaken;трясти
s;shear;sheared;sheared/shorn;стричь
s;shed;shed;shed;проливать
s;shine;shone;shone;светить,сиять
s;shoe;shod;shod;обувать,подковывать
s;shoot;shot;shot;стрелять
s;show;showed;shown;показывать
s;shrink;shrank/shrunk;shrunk;сокращаться,сжиматься
s;shut;shut;shut;закрывать
s;sing;sang;sung;петь
s;sink;sank;sunk;тонуть,погружаться
s;sit;sat;sat;сидеть
s;slay;slew;slain;убивать,уничтожать
s;sleep;slept;slept;спать
s;slide;slid;slid;скользить
s;sling;slung;slung;бросать,швырять
s;slink;slunk;slunk;красться
s;slit;slit;slit;рвать
s;smell;smelt;smelt;чувствоватьзапах,нюхать
s;smite;smote;smitten;ударять,бить
s;sow;sowed;sown;сеять
s;speak;spoke;spoken;говорить
s;speed;sped/speeded;sped/speeded;мчаться,спешить
s;spend;spent;spent;тратить
s;spell;spelt/spelled;spelt/spelled;писатьилипроизноситьпобуквам
s;spill;spilt/spilled;spilt/spilled;проливать
s;spin;spun;spun;прясть,оборачиваться
s;spit;spat;spat;плевать
s;split;split;split;расколоть,разбить
s;spoil;spoilt/spoiled;spoilt/spoiled;портить
s;spotlight;spotlit/spotlighted;spotlit/spotlighted;осветить
s;spread;spread;spread;распространяться
s;spring;sprang;sprung;бросаться,возникнуть
s;stand;stood;stood;стоять
s;stick;stuck;stuck;приклеивать,сдержаться
s;sting;stung;stung;жалить
s;stink;stank/stunk;stunk;вонять
s;steal;stole;stolen;красть
s;strew;strewed;strewn;разбрасывать
s;stride;strode;stridden;шагать
s;strike;struck;struck;ударять,бить
s;string;strung;strung;натягивать,нанизывать
s;strive;strove;striven;стараться
s;sublet;sublet;sublet;сдаватьвсубаренду
s;swear;swore;sworn;клясться,ругаться
s;sweep;swept;swept;подметать,мчаться
s;swell;swelled;swollen;разбухать
s;swim;swam;swum;плавать
s;swing;swung;swung;качаться,вертеться
t;take;took;taken;брать
t;teach;taught;taught;обучать
t;tear;tore;torn;рвать
t;tell;told;told;сказать
t;think;thought;thought;думать
t;thrive;throve/thrived;thriven/thrived;преуспевать,процветать
t;throw;threw;thrown;бросать
t;thrust;thrust;thrust;толкать,засовывать
t;tread;trod;trodden;ступать,наступать
u;unbend;unbent;unbent;выпрямляться,разгибаться
u;undercut;undercut;undercut;подрезать,сбиватьцены
u;undergo;underwent;undergone;испытывать,подвергаться
u;underlie;underlay;underlain;лежатьвоснове
u;underpay;underpaid;underpaid;недоплачивать
u;undersell;undersold;undersold;продаватьдешевле
u;understand;understood;understood;понимать
u;underwrite;underwrote;underwritten;подписывать,гарантировать
u;undertake;undertook;undertaken;предпринимать,совершать
u;undo;undid;undone;расстёгивать,развязывать
u;unwind;unwound;unwound;разматывать
u;uphold;upheld;upheld;поддерживать,одобрять
u;upset;upset;upset;опрокидывать,расстраивать
w;wake;woke;woken;просыпаться,будить
w;waylay;waylaid;waylaid;подстерегать
w;wear;wore;worn;носить(одежду)
w;weave;wove;woven;ткать,плести
w;wed;wed/wedded;wed/wedded;жениться,выходитьзамуж
w;weep;wept;wept;плакать
w;wet;wet/wetted;wet/wetted;мочить,смачивать
w;win;won;won;выигрывать
w;wind;wound;wound;обматывать,заводить(часы)
w;withdraw;withdrew;withdrawn;взятьназад
w;withhold;withheld;withheld;воздерживаться,удерживать
w;withstand;withstood;withstood;выдержать,противостоять
w;wring;wrung;wrung;крутить,жать
w;write;wrote;written;писать
